Revit 2026 API

# RebarHandlePositionData Properties

---

The RebarHandlePositionData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

RebarHandlePositionData Class

Autodesk.Revit.DB.Structure Namespace